In [13]:
# Using Decsion Tree algo , need to classify the job based on salary >100K
import pandas as pd
import numpy as np

In [15]:
df1=pd.read_csv("c:\\python\\ML\\salaries.csv")

In [16]:
df1.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

df.shape

In [17]:
df1.shape

(16, 4)

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
company                  16 non-null object
job                      16 non-null object
degree                   16 non-null object
salary_more_then_100k    16 non-null int64
dtypes: int64(1), object(3)
memory usage: 592.0+ bytes

In [19]:
x=df1.drop(['salary_more_then_100k'],axis='columns') # selecting InDepedent varaiable

In [20]:
x.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [21]:
y=df1['salary_more_then_100k']  # Selecting dependent varaiable

In [22]:
y.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

## Too change all independent varaiable from Category to Numerical_LabelEncoder

In [23]:
from sklearn.preprocessing import LabelEncoder
le_c=LabelEncoder()
le_j= LabelEncoder()
le_d=LabelEncoder()

In [39]:
x['company_n']=le_c.fit_transform(df1['company'])
x['job_n']=le_j.fit_transform(df1['job'])
x['degree_n']=le_j.fit_transform(df1['degree'])

In [40]:
x

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [42]:
df1_n=x.drop(['company','job','degree'],axis=1)

In [43]:
df1_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [44]:
df1_n.head()

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

## Apply decision tree algorithm

In [45]:
from sklearn import tree

In [46]:
M3=tree.DecisionTreeClassifier()
M3.fit(df1_n,y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [47]:
M3.score(df1_n,y)

1.0

## Is salary of Google, Computer Engineer, Bachelors degree > 100 k ?

In [49]:
M3.predict([[2,1,0]])

array([0], dtype=int64)

##  Is salary of Google, Computer Engineer, Masters degree > 100 k ?

In [50]:
M3.predict([[2,1,1]])

array([1], dtype=int64)

## observation , Here model is predicted with score of 1.